## Plan Result (Managed_Identity)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.admin-acme-vault-access
* Update
  * azurerm_resource_group.application-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.application-mi will be updated in-place
  ~ resource "azurerm_resource_group" "application-mi" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/managed-identities-sbox-rg"
        name     = "managed-identities-sbox-rg"
      ~ tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.admin-acme-vault-access will be created
  + resource "azurerm_role_assignment" "admin-acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0519aa9e-cca8-4099-b094-26ba89806fbd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":523,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity","Vars":{}} -->